---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternKey.#ctor(Autodesk.Revit.DB.ExportPatternKey)
source: html/d9ffc619-c118-822d-c4de-fc0e1662bae0.htm
---
# Autodesk.Revit.DB.ExportPatternKey.#ctor Method

Constructs a new copy of the input ExportPatternKey object.

## Syntax (C#)
```csharp
public ExportPatternKey(
	ExportPatternKey other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExportPatternKey`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null